<h2> Binning dengan ketentuan sendiri</h2>

In [1]:
from sklearn.pipeline import Pipeline
import pandas as pd 
import numpy as np

In [3]:
data = pd.read_csv('./main/datasetgaji.csv')
data.head()

             Nama Status Rumah  Gaji Orang Tua  Keterangan
0      aldi taher      Kontrak         2100000         NaN
1          kekeyi        Milik         4000000         NaN
2   rangga sasana      Kontrak         1400000         NaN
3  vicky prasetyo      Kontrak          700000         NaN
4            zuko        Milik          650000         NaN

In [8]:
#Membuat batas manual
batas_bin = [0,1400000,4000000] #variabel batas bin penggambarannya -> 0 > n < 1400000 > n > 4000000

In [9]:
kategori = ['kecil', 'besar']

In [10]:
data['gaji_binned_1'] = pd.cut(data['Gaji Orang Tua'], bins=batas_bin, labels=kategori)

In [11]:
print(data)

             Nama Status Rumah  Gaji Orang Tua  Keterangan gaji_binned_1
0      aldi taher      Kontrak         2100000         NaN         besar
1          kekeyi        Milik         4000000         NaN         besar
2   rangga sasana      Kontrak         1400000         NaN         kecil
3  vicky prasetyo      Kontrak          700000         NaN         kecil
4            zuko        Milik          650000         NaN         kecil
5           dyrga      Kontrak          450000         NaN         kecil

<h2>Binning dengan linespace</h2>

In [13]:
bins = np.linspace(min(data['Gaji Orang Tua']), max(data['Gaji Orang Tua']), 3)
# jadi batasnya adalah dengan mengambil nilai minimum & maksimum , lalu 
# mesin akan menetapkan 1 batas tengah dengan jarak dari minimum ke batas tengah , dan batas tengah ke maksimum sama
# nilai 3 karena banyak data ada 6 sehingga jika ingin ada 2 kategorikal maka harus diabagi 3

In [14]:
bins

array([ 450000., 2225000., 4000000.])

In [19]:
kategori = ['kecil', 'besar']
data['gaji_binned2'] = pd.cut(data['Gaji Orang Tua'], bins=bins, labels= kategori, include_lowest = True)
#include_lowest apabila true itu berarti apakah kita akan memasukkan data yang paling rendah atau tidak

In [20]:
data

,Nama,Status Rumah,Gaji Orang Tua,Keterangan,gaji_binned_1,gaji_binned2
0,aldi taher,Kontrak,2100000,NaN,besar,kecil
1,kekeyi,Milik,4000000,NaN,besar,besar
2,rangga sasana,Kontrak,1400000,NaN,kecil,kecil
3,vicky prasetyo,Kontrak,700000,NaN,kecil,kecil
4,zuko,Milik,650000,NaN,kecil,kecil
5,dyrga,Kontrak,450000,NaN,kecil,kecil

<h2>Binning dengan Quantile</h2>

In [32]:
data['gaji_binned3'] = pd.qcut(data['Gaji Orang Tua'], 2)
data

,Nama,Status Rumah,Gaji Orang Tua,Keterangan,gaji_binned_1,gaji_binned2,gaji_binned,gaji_binned3
0,aldi taher,Kontrak,2100000,NaN,besar,kecil,"(1050000.0, 4000000.0]","(1050000.0, 4000000.0]"
1,kekeyi,Milik,4000000,NaN,besar,besar,"(1050000.0, 4000000.0]","(1050000.0, 4000000.0]"
2,rangga sasana,Kontrak,1400000,NaN,kecil,kecil,"(1050000.0, 4000000.0]","(1050000.0, 4000000.0]"
3,vicky prasetyo,Kontrak,700000,NaN,kecil,kecil,"(449999.999, 1050000.0]","(449999.999, 1050000.0]"
4,zuko,Milik,650000,NaN,kecil,kecil,"(449999.999, 1050000.0]","(449999.999, 1050000.0]"
5,dyrga,Kontrak,450000,NaN,kecil,kecil,"(449999.999, 1050000.0]","(449999.999, 1050000.0]"

In [38]:
data['gaji_binned3'] = pd.qcut(data['Gaji Orang Tua'], q=2, labels=kategori)
data

,Nama,Status Rumah,Gaji Orang Tua,Keterangan,gaji_binned_1,gaji_binned2,gaji_binned3
0,aldi taher,Kontrak,2100000,NaN,besar,kecil,besar
1,kekeyi,Milik,4000000,NaN,besar,besar,besar
2,rangga sasana,Kontrak,1400000,NaN,kecil,kecil,besar
3,vicky prasetyo,Kontrak,700000,NaN,kecil,kecil,kecil
4,zuko,Milik,650000,NaN,kecil,kecil,kecil
5,dyrga,Kontrak,450000,NaN,kecil,kecil,kecil